# Pandas

In [2]:
import numpy as np
import pandas as pd

In [151]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

#### 0. Создать датафрейм.

In [152]:
df  = pd.DataFrame(data)
df

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no
3    dog  NaN       3      yes
4    dog  5.0       2       no
5    cat  2.0       3       no
6  snake  4.5       1       no
7    cat  NaN       1      yes
8    dog  7.0       2       no
9    dog  3.0       1       no

#### 1. Вывести информацию о датафрейме.

In [153]:
df.info

<bound method DataFrame.info of   animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no
3    dog  NaN       3      yes
4    dog  5.0       2       no
5    cat  2.0       3       no
6  snake  4.5       1       no
7    cat  NaN       1      yes
8    dog  7.0       2       no
9    dog  3.0       1       no>

#### 2. Вернуть первые 3 строки DataFrame `df`.

In [154]:
df[:3]

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no

#### 3. Выберите только столбцы 'animal' и 'age' из DataFrame `df`.

In [155]:
df[['animal','age']]

  animal  age
0    cat  2.5
1    cat  3.0
2  snake  0.5
3    dog  NaN
4    dog  5.0
5    cat  2.0
6  snake  4.5
7    cat  NaN
8    dog  7.0
9    dog  3.0

#### 4. Выберите данные в строках `[3, 4, 8]` * и * в столбцах `['animal', 'age']`.

In [156]:
df.iloc[[3,4,8], 0:2]

  animal  age
3    dog  NaN
4    dog  5.0
8    dog  7.0

#### 5. Выберите строки где количество посещений больше 3.

In [157]:
df[df['visits'] > 3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

#### 6. Выберите строки, в которых отсутствует возраст.

In [158]:
df[df['age'].isnull()]

  animal  age  visits priority
3    dog  NaN       3      yes
7    cat  NaN       1      yes

#### 7. Выберите строки, в которых животное является кошкой * и * возраст составляет менее 3 лет.

In [159]:
df[(df['age'] <=3) & (df['animal'] == 'cat')]

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
5    cat  2.0       3       no

#### 8. Выберите строки в которых возраст от 2 до 4 (включительно).

In [160]:
df[(df['age'] >= 2) & (df['age'] <= 4)]

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
5    cat  2.0       3       no
9    dog  3.0       1       no

#### 9. Измените возраст в строке 'f' на 1,5.

In [161]:
df['age']['f'] = 1.5
df

/home/pavel/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no
3    dog  NaN       3      yes
4    dog  5.0       2       no
5    cat  2.0       3       no
6  snake  4.5       1       no
7    cat  NaN       1      yes
8    dog  7.0       2       no
9    dog  3.0       1       no

#### 10. Рассчитать общее количество всех посещений.

In [162]:
df['visits'].sum()

19

#### 11. Расчитайте суммарный возраст животных

In [163]:
df['age'].sum()

29.0

#### 12. Добавьте новую строку `k` к `df` со значениями по вашему желанию. Затем удалите ее.

In [164]:
df.loc[len(df)] = ["kek", 4,2,1]

df

   animal  age  visits priority
0     cat  2.5       1      yes
1     cat  3.0       3      yes
2   snake  0.5       2       no
3     dog  NaN       3      yes
4     dog  5.0       2       no
5     cat  2.0       3       no
6   snake  4.5       1       no
7     cat  NaN       1      yes
8     dog  7.0       2       no
9     dog  3.0       1       no
10    kek  4.0       2        1

In [165]:
df = df.drop (df.tail (1) .index)
df

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no
3    dog  NaN       3      yes
4    dog  5.0       2       no
5    cat  2.0       3       no
6  snake  4.5       1       no
7    cat  NaN       1      yes
8    dog  7.0       2       no
9    dog  3.0       1       no

#### 13. Подсчитайте количество животных каждого типа в `df`.

In [166]:
df['animal'].value_counts()

cat      4
dog      4
snake    2
Name: animal, dtype: int64

#### 14. Сортируйте `df` сначала по значениям в 'age' в * возрастающем * порядке, затем по значениям в столбце 'visit' в * возрастающем * порядке.

In [167]:
df = df.sort_values(['age', 'visits'], ascending=[True, False])
df

  animal  age  visits priority
2  snake  0.5       2       no
5    cat  2.0       3       no
0    cat  2.5       1      yes
1    cat  3.0       3      yes
9    dog  3.0       1       no
6  snake  4.5       1       no
4    dog  5.0       2       no
8    dog  7.0       2       no
3    dog  NaN       3      yes
7    cat  NaN       1      yes

#### 15. В столбце приоритет замените значения на `Yes` и `No`

#### 16. В столбце «animal» измените записи «snake» на «python».

In [168]:
df['animal']['snake'] = 'python'
df

/home/pavel/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

  animal  age  visits priority
2  snake  0.5       2       no
5    cat  2.0       3       no
0    cat  2.5       1      yes
1    cat  3.0       3      yes
9    dog  3.0       1       no
6  snake  4.5       1       no
4    dog  5.0       2       no
8    dog  7.0       2       no
3    dog  NaN       3      yes
7    cat  NaN       1      yes

#### 17. Удалите все повторения строк из таблицы
```python
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

In [169]:
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

In [170]:
df = df.drop_duplicates()
df

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

#### 20. Предположим, у вас есть DataFrame с 10 столбцами действительных чисел, например:

```python
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = список ('abcdefghij'))
```
#### Какой столбец имеет наименьшую сумму? Найдите метку этого столбца.

In [171]:
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = list ('abcdefghij'))
df

,a,b,c,d,e,f,g,h,i,j
0,0.262244,0.276914,0.735955,0.309107,0.703551,0.203528,0.197212,0.726096,0.557238,0.213198
1,0.054084,0.080935,0.542609,0.014156,0.890188,0.989563,0.517574,0.505803,0.448123,0.068416
2,0.935551,0.022873,0.684642,0.751262,0.404836,0.877560,0.592377,0.472240,0.551479,0.667184
3,0.748963,0.858259,0.737597,0.346925,0.246683,0.745385,0.271903,0.556434,0.364639,0.591153
4,0.050790,0.352135,0.992549,0.057049,0.825476,0.980118,0.266657,0.041330,0.947840,0.766962

In [172]:
lst = list(df.columns)
label = ''
_min = df[lst[0]].sum()
for i in lst:
    print(df[i].sum(), i)
    if _min > df[i].sum():
        _min = df[i].sum()
        label = i
label

2.051632448875017 a
1.5911161649804533 b
3.6933521557761004 c
1.478498330078564 d
3.0707337743463237 e
3.7961523764588208 f
1.8457231271873393 g
2.301903955257622 h
2.869318550995131 i
2.3069134833763263 j

'd'

#### 21. Замените все пропущенные значения, на среднее по столбцу
```python
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
```

In [173]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
df

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0

In [174]:
df['value'].fillna((df['value'].mean()), inplace=True)
df

   group     value
0      a  1.000000
1      a  2.000000
2      b  3.000000
3      b  3.333333
4      a  2.000000
5      b  3.000000
6      b  3.333333
7      b  1.000000
8      a  7.000000
9      b  3.000000
10     a  3.333333
11     b  8.000000

#### 22. Создайте два новых столбца, для From и To. Приведите названия городов к нормальному виду.

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

In [175]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [176]:
_from = []
to = []
for i in list(df["From_To"]):
    temp = i.split("_")
    _from.append(temp[0])
    to.append(temp[1])
for i in range(len(_from)):
    str1 = _from[i]
    str2 = to[i]
    
    str1 = str1.lower()
    str1 = str1.title()
    
    str2 = str2.lower()
    str2 = str2.title()
    _from[i] = str1
    to[i] = str2
    
print(_from)
print(to)


df

['London', 'Madrid', 'London', 'Budapest', 'Brussels']
['Paris', 'Milan', 'Stockholm', 'Paris', 'London']

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [177]:
df.drop('From_To', axis=1, inplace=True)
df['From'] = pd.Series(np.array(_from), index=df.index)
df['To'] = pd.Series(np.array(to), index=df.index)

In [178]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1           NaN            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3           NaN          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

#### Доп задачи

In [26]:
# 1. создать датафрейм
# Ваш код здесь
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df  = pd.DataFrame(data)
df

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no
3    dog  NaN       3      yes
4    dog  5.0       2       no
5    cat  2.0       3       no
6  snake  4.5       1       no
7    cat  NaN       1      yes
8    dog  7.0       2       no
9    dog  3.0       1       no

In [27]:
# Вывести первые 3 строки
# Ваш код здесь
df[:][:3]

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no

In [32]:
# Вывести значения где пропущены age
# Ваш код здесь

df[:][df['age'].isna()]

  animal  age  visits priority
3    dog  NaN       3      yes
7    cat  NaN       1      yes

In [34]:
# Вывести сумму всех посещений
# Ваш код здесь
df['visits'].sum()

19

In [35]:
# Посчитать количество каждого типа в колонке animal
# Ваш код здесь
df['animal'].value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

In [36]:
# Сохранить в формате csv
# Ваш код здесь
df.to_csv('out.csv')